export default {
       periods: [
        [
            {
                "place":"蒙城县坛城镇张圩村",
                "type":"青白土",
                "period":"小麦抽穗期",
                "legend":["自然含水量","4月3日含水量","4月12日含水量"],
                "deep":["0 ~ 10","10 ~ 20","20 ~ 40","40 ~ 60"],
                "evaluation":["过多","过多","过多","稍多"],
                "nature":[23.92, 20.11, 20.12, 22.7],
                "last":[72.57, 80.11, 80.71, 66.49],
                "current":[95.37, 92.59, 94.42, 86.25]
            },
            {
                "place":"蒙城县漆园镇前王村",
                "type":"黑土",
                "period":"小麦抽穗期",
                "legend":["自然含水量","4月3日含水量","4月12日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40","40 ~ 60"],
                "evaluation":["过多","过多","过多","过多"],
                "nature":[27.11, 23.05, 22.97, 29.5],
                "last":[70.38, 80.70, 81.65, 78.32],
                "current":[94.92, 97.79, 98.71, 90.97]
            },
            {
                "place":"蒙城县楚村镇陈桥村",
                "type":"黄土",
                "period":"小麦抽穗期",
                "legend":["自然含水量","4月3日含水量","4月12日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40","40 ~ 60"],
                "evaluation":["过多","稍多","稍多","稍多"],
                "nature":[26.24, 24.9, 23.3, 25.21],
                "last":[70.75, 68.21, 79.55, 77.46],
                "current":[96.29, 89.54, 81.04, 87.17]
            },
            {
                "place":"蒙城县岳坊镇母集村",
                "type":"黄土",
                "period":"小麦抽穗期",
                "legend":["自然含水量","4月3日含水量","4月12日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40","40 ~ 60"],
                "evaluation":["适宜","适宜","适宜","适宜"],
                "nature":[20.9, 20.6, 20.5, 20.49],
                "last":[71.68, 85.38, 85.57, 87.10],
                "current":[76.39, 73.28, 71.30, 70.85]
            },
            {
                "place":"蒙城县乐土示范场",
                "type":"黑土",
                "period":"小麦抽穗期",
                "legend":["自然含水量","4月3日含水量","4月12日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40","40 ~ 60"],
                "evaluation":["稍多","稍多","适宜","过多"],
                "nature":[24.4, 24.7, 20.7, 25.7],
                "last":[66.55, 62.19, 61.12, 62.32],
                "current":[88.25, 84.21, 76.22, 92.05]
            },
            {
                "place":"蒙城县庄周乡后娄村",
                "type":"黄土",
                "period":"小麦抽穗期",
                "legend":["自然含水量","4月3日含水量","4月12日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40","40 ~ 60"],
                "evaluation":["过多","稍多","过多","过多"],
                "nature":[24.58, 23.1, 21.9, 23.16],
                "last":[79.18, 72.30, 81.61, 75.53],
                "current":[94.94, 89.99, 92.60, 95.07]
            },
            {
                "place":"蒙城县辛集乡城西村",
                "type":"坡黄土",
                "period":"小麦抽穗期",
                "legend":["自然含水量","4月3日含水量","4月12日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40","40 ~ 60"],
                "evaluation":["过多","过多","稍多","稍多"],
                "nature":[28.14, 27, 23.3, 23.1],
                "last":[75.77, 70.56, 65.61, 69.44],
                "current":[96.04, 90.12, 83.99, 84.43]
            },
            {
                "place":"蒙城县双涧镇老集村",
                "type":"两合土",
                "period":"小麦抽穗期",
                "legend":["自然含水量","4月3日含水量","4月12日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40","40 ~ 60"],
                "evaluation":["稍多","适宜","适宜","适宜"],
                "nature":[24.4, 22.04, 19.8, 19.7],
                "last":[69.84, 63.16, 65.71, 66.76],
                "current":[89.21, 73.27, 71.10, 71.48]
            }
        ],
        [
            {
                "place":"蒙城县坛城镇张圩村",
                "type":"青白土",
                "period":"小麦播种出苗期",
                "legend":["自然含水量","11月3日含水量","11月10日含水量"],
                "deep":["0 ~ 5","5 ~ 10","10 ~ 20"],
                "evaluation":["适宜", "适宜", "过多"],
                "nature":[20.3, 21.3, 21.4],
                "last":[86.52, 80.14, 97.15],
                "current":[80.98, 84.79, 98.60]
            },
            {
                "place":"蒙城县漆园镇前王村",
                "type":"黑土",
                "period":"小麦播种出苗期",
                "legend":["自然含水量","11月3日含水量","11月10日含水量"],
                "deep":["0 ~ 5","5 ~ 10","10 ~ 20"],
                "evaluation":["适宜", "适宜", "过多"],
                "nature":[23.1, 23.2, 22.8],
                "last":[91.04, 87.54, 98.43],
                "current":[81.03, 81.24, 96.62]
            },
            {
                "place":"蒙城县楚村镇陈桥村",
                "type":"黄土",
                "period":"小麦播种出苗期",
                "legend":["自然含水量","11月3日含水量","11月10日含水量"],
                "deep":["0 ~ 5","5 ~ 10","10 ~ 20"],
                "evaluation":["适宜", "稍多", "适宜"],
                "nature":[22.4, 23.5, 23.6],
                "last":[94.68, 88.07, 84.86],
                "current":[82.16, 86.33, 84.80]
            },
            {
                "place":"蒙城县岳坊镇母集村",
                "type":"黄土",
                "period":"小麦播种出苗期",
                "legend":["自然含水量","11月3日含水量","11月10日含水量"],
                "deep":["0 ~ 5","5 ~ 10","10 ~ 20"],
                "evaluation":["不足", "适宜", "适宜"],
                "nature":[17.3, 22.7, 21.9],
                "last":[64.33, 78.58, 76.49],
                "current":[63.25, 82.80, 77.91]
            },
            {
                "place":"蒙城县乐土示范场",
                "type":"黑土",
                "period":"小麦播种出苗期",
                "legend":["自然含水量","11月3日含水量","11月10日含水量"],
                "deep":["0 ~ 5","5 ~ 10","10 ~ 20"],
                "evaluation":["适宜", "过多", "稍多"],
                "nature":[25.7, 25.6, 25.9],
                "last":[81.01, 92.59, 96.83],
                "current":[92.82, 92.42, 88.37]
            },
            {
                "place":"蒙城县庄周乡后娄村",
                "type":"黄土",
                "period":"小麦播种出苗期",
                "legend":["自然含水量","11月3日含水量","11月10日含水量"],
                "deep":["0 ~ 5","5 ~ 10","10 ~ 20"],
                "evaluation":["稍多", "适宜", "适宜"],
                "nature":[22.8, 21.5, 21.9],
                "last":[93.86, 94.24, 87.26],
                "current":[88.14, 83.20, 85.37]
            },
            {
                "place":"蒙城县辛集乡城西村",
                "type":"坡黄土",
                "period":"小麦播种出苗期",
                "legend":["自然含水量","11月3日含水量","11月10日含水量"],
                "deep":["0 ~ 5","5 ~ 10","10 ~ 20"],
                "evaluation":["稍多", "稍多", "适宜"],
                "nature":[26.2, 26.0, 25.1],
                "last":[98.32, 96.25, 80.77],
                "current":[89.57, 88.89, 83.80]
            },
            {
                "place":"蒙城县双涧镇老集村",
                "type":"两合土",
                "period":"小麦播种出苗期",
                "legend":["自然含水量","11月3日含水量","11月10日含水量"],
                "deep":["0 ~ 5","5 ~ 10","10 ~ 20"],
                "evaluation":["适宜", "适宜", "适宜"],
                "nature":[20.0, 21.0, 21.9],
                "last":[75.69, 87.75, 71.48],
                "current":[73.26, 76.84, 72.79]
            }
        ],
        [
            {
                "place":"蒙城县坛城镇张圩村",
                "type":"青白土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月11日含水量","12月18日含水量"],
                "deep":["0 ~ 10","10 ~ 20","20 ~ 40"],
                "evaluation":["适宜", "稍多", "过多"],
                "nature":[18.8, 18.5, 18.9],
                "last":[74.96, 85.64, 87.75],
                "current":[74.96, 85.17, 88.69]
            },
            {
                "place":"蒙城县漆园镇前王村",
                "type":"黑土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月11日含水量","12月18日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["不足", "稍多", "过多"],
                "nature":[16.9, 20, 20.8],
                "last":[63.38, 85.28, 90.67],
                "current":[59.17, 84.85, 89.39]
            },
            {
                "place":"蒙城县楚村镇陈桥村",
                "type":"黄土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月11日含水量","12月18日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["适宜", "适宜", "过多"],
                "nature":[20.4, 20.9, 25.6],
                "last":[69.72, 78.39, 89.39],
                "current":[74.86, 75.15, 89.04]
            },
            {
                "place":"蒙城县岳坊镇母集村",
                "type":"黄土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月11日含水量","12月18日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["适宜", "适宜", "适宜"],
                "nature":[20.2, 19.8, 21.6],
                "last":[62.13, 75.77, 81.39],
                "current":[73.83, 70.44, 75.13]
            },
            {
                "place":"蒙城县乐土示范场",
                "type":"黑土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月11日含水量","12月18日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["稍多", "适宜", "稍多"],
                "nature":[22.6, 20.9, 22.5],
                "last":[79.93, 72.62, 88.73],
                "current":[81.74, 71.26, 82.84]
            },
            {
                "place":"蒙城县庄周乡后娄村",
                "type":"黄土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月11日含水量","12月18日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["稍多", "稍多", "过多"],
                "nature":[20.1, 21.1, 20.8],
                "last":[80.73, 82.59, 87.10],
                "current":[77.64, 82.20, 87.95]
            },
            {
                "place":"蒙城县辛集乡城西村",
                "type":"坡黄土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月11日含水量","12月18日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["适宜", "适宜", "稍多"],
                "nature":[22.7, 21.8, 23.2],
                "last":[74.74, 75.43, 84.35],
                "current":[77.47, 72.76, 83.63]
            },
            {
                "place":"蒙城县双涧镇老集村",
                "type":"两合土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月11日含水量","12月18日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["适宜", "适宜", "适宜"],
                "nature":[20.1, 20.4, 19.6],
                "last":[63.62, 65.16, 69.66],
                "current":[73.49, 67.82, 70.38]
            }
        ],
        [
            {
                "place":"蒙城县坛城镇张圩村",
                "type":"青白土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月18日含水量","12月25日含水量"],
                "deep":["0 ~ 10","10 ~ 20","20 ~ 40"],
                "evaluation":["适宜", "稍多", "稍多"],
                "nature":[16.7, 17.8, 17.9],
                "last":[74.96, 85.17, 88.69],
                "current":[66.59, 81.95, 84.00]
            },
            {
                "place":"蒙城县漆园镇前王村",
                "type":"黑土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月18日含水量","12月25日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["不足", "稍多", "过多"],
                "nature":[16.6, 19.7, 19.8],
                "last":[59.17, 84.85, 89.39],
                "current":[58.12, 83.58, 85.09]
            },
            {
                "place":"蒙城县楚村镇陈桥村",
                "type":"黄土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月18日含水量","12月25日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["适宜", "适宜", "稍多"],
                "nature":[18, 21.1, 23.2],
                "last":[74.86, 75.15, 89.04],
                "current":[66.06, 75.87, 80.70]
            },
            {
                "place":"蒙城县岳坊镇母集村",
                "type":"黄土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月18日含水量","12月25日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["适宜", "适宜", "过多"],
                "nature":[18.8, 19.1, 25.8],
                "last":[73.83, 70.44, 75.13],
                "current":[68.71, 67.95, 89.74]
            },
            {
                "place":"蒙城县乐土示范场",
                "type":"黑土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月18日含水量","12月25日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["稍多", "适宜", "稍多"],
                "nature":[21.2, 21.2, 21.1],
                "last":[81.74, 71.26, 82.84],
                "current":[76.67, 72.28, 77.69]
            },
            {
                "place":"蒙城县庄周乡后娄村",
                "type":"黄土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月18日含水量","12月25日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["稍多", "稍多", "过多"],
                "nature":[19.6, 20, 20.6],
                "last":[77.64, 82.20, 87.95],
                "current":[75.70, 77.91, 87.10]
            },
            {
                "place":"蒙城县辛集乡城西村",
                "type":"坡黄土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月18日含水量","12月25日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["适宜", "适宜", "稍多"],
                "nature":[21.5, 22.2, 23.8],
                "last":[77.47, 72.76, 83.63],
                "current":[73.38, 74.10, 85.80]
            },
            {
                "place":"蒙城县双涧镇老集村",
                "type":"两合土",
                "period":"小麦分蘖期",
                "legend":["自然含水量","12月18日含水量","12月25日含水量"],
                "deep":["0 ~ 10","0 ~ 20","20 ~ 40"],
                "evaluation":["不足", "不足", "适宜"],
                "nature":[16.5, 18.7, 19.1],
                "last":[73.49, 67.82, 70.38],
                "current":[60.33, 62.17, 68.58]
            }
        ]                             
    ],
        
  option : {
    title: {
        text: '',
        bottom:'0%',
        left: 'center',
        subtext:'',
        subtextStyle:{
            fontWeight:'normal',
            color:'rgb(172, 134, 52)',
            fontFamily:'arial',
            fontSize:'15',
        }


    },
    tooltip: {
        confine:true,
        backgroundColor : 'rgba(10,10,10,0.7)',
        trigger: 'axis',
        formatter: null,
        
        textStyle : {
            color: 'skyblue',
            decoration: 'none',
            fontFamily: 'Verdana, sans-serif',
            fontSize: 15,
        },
    },
    
    legend: {
        data:['自然含水量','4月3日含水量','4月12日含水量'],
        // data:[{name:'自然含水量',},{name:'4月3日含水量'},{name:'4月12日含水量',}],
        orient:"horizontal",
        textStyle : {
            fontSize: 12,
        },
        left: '12%',
    },
    grid: {
        left: '10%',
        right: '18%',
        bottom: '20%',
        containLabel: true
    },
    
    xAxis: {
        name: 'cm',
        type: 'category',
        boundaryGap: true,
        data: []
    },
    yAxis: {
        name:'含水量(%)',
        type: 'value',
        boundaryGap: true,
        max: 100
    },
    series: []
}}

